import { Translation } from '../models';

export const translation: Translation = {
    'themeInstalled': 'Viking Icons Theme 🛡️⚔️ был установлен.',
    'howToActivate': 'Как активировать иконки',
    'activate': 'Активировать',
    'activated': 'Viking Icons Theme 🛡️⚔️ активен.',
    'neverShowAgain': 'Никогда не показывать снова',
    'themeUpdated': 'Viking Icons Theme 🛡️⚔️ был обновлен.',
    'readChangelog': 'Читать изменения версии',
    'iconPacks': {
        'selectPack': 'Выбрать набор иконок',
        'description': 'Выбрать \'%0\' набор иконок',
        'disabled': 'Выключить набор иконок',
    },
    'folders': {
        'toggleIcons': 'Выбрать тему папки',
        'color': 'Выбрать цвет папки',
        'hexCode': 'Вставить HEX-код цвета',
        'wrongHexCode': 'Неверный HEX-код цвета!',
        'disabled': 'Нет иконки для папки',
        'theme': {
            'description': 'Выбрать \'%0\' тему папки'
        }
    },
    'opacity': {
        'inputPlaceholder': 'Значение непрозрачности (от 0 до 1)',
        'wrongValue': 'Значение должно быть от 0 до 1!',
    },
    'toggleSwitch': {
        'on': 'Включить',
        'off': 'Выключить'
    },
    'explorerArrows': {
        'toggle': 'Показать/Скрыть стрелки у папок',
        'enable': 'Показать стрелки у папок',
        'disable': 'Скрыть стрелки у папок'
    },
    'confirmReload': 'Нужно перезапустить VS Code для активации иконок.',
    'reload': 'Перезагрузить',
    'outdatedVersion': 'Нужно обновить VS Code чтобы использовать эту команду.',
    'updateVSCode': 'Обновить VS Code'
};
